print('start code')#вывод строки
books = [#создаем список, содержащий словари с информацей о книгах
   {"title":"Оно",
    "author": "Стивен Кинг",
    "year": 1986 },

    {"title":"Война и мир",
    "author": "Лев Николаевич Толстой",
    "year": 1869 },

    {"title": "Гамлет" ,
    "author": "Уильям Шекспир",
    "year": 1603 },

    {"title":"1984",
    "author": "Джордж Оруэлл",
    "year": 1984 },
    
    {"title":"Сто лет одиночества",
    "author": "Габриэль Гарсиа Маркес",
    "year": 1967 }
]
for i in range(len(books)):#цикл для перебора словаря
    print(f"--------Книга {i+1}--------")#выводим номер книги
    print(f"Название: {books[i]["title"]}, Автор: {books[i]["author"]}")#выводим нахвание и автора
    print(f"--------{books[i]["year"]}--------")    #выводим год написания
print("конец")    #вывод строки 
